In [1]:
# import library used for data management
import numpy as np 
import pandas as pd

In [2]:
# load datasets
train = pd.read_csv('train.csv',index_col = 'PassengerId')
test = pd.read_csv('test.csv',index_col = 'PassengerId') #since passenger ID would have ranged form 0-890, but now since it is an index, it will become 1-891

In [3]:
# to view the whole training set
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
test #have to predict on this dataset

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [5]:
# to view the first 5 lines in the training set
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
# to view training set information
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [11]:
# to descirbe the numerical variables in training set
train.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [12]:
# to describe categorical variables in traning set
train['Sex'].describe()

count      891
unique       2
top       male
freq       577
Name: Sex, dtype: object

###### view the testing set information, which attributes have missing values?

# Deal with missing values
### The train dataset has missing values in Age, Embarked and Cabin

In [14]:
train['Age'].mean()

29.69911764705882

In [15]:
# replace missing value in "Age" with mean
train['Age'].fillna(train['Age'].mean(),inplace=True)

In [16]:
train['Age'].mean()

29.699117647058763

In [17]:
# show description of age again
train['Age'].describe()

count    891.000000
mean      29.699118
std       13.002015
min        0.420000
25%       22.000000
50%       29.699118
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [18]:
# replace missing values in "Embarked" with most frequent appeared value
train['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [21]:
train['Embarked'].fillna(train['Embarked'].mode,inplace=True)

In [22]:
# directly replace with "S"
#train['Embarked'].fillna("S",inplace=True)

In [24]:
# What shall we do with missing values in "Cabin"? Since we have 204 values and total of 891 entries, just drop the column completely
train = train.drop(columns='Cabin')

KeyError: "['Cabin'] not found in axis"

In [25]:
# Check the training set info again
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       891 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Embarked  891 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 76.6+ KB

###### How can you deal with the missing values in test set?

# Furthur prepare the data

#### 1. Discretization / Binning

In [ ]:
# Bining / Descritization
# give names for different age group
group_names = ['Young', 'Middle-aged', 'Senior']

In [ ]:
# divide Age into 3 equal interval groups and give corresponding names
train['Age-binned']=pd.cut(train['Age'], 3 , labels=group_names)

In [ ]:
# View Age-binned in bar chart
train['Age-binned'].value_counts().plot(kind='bar')

#### 2. Normalization

In [ ]:
# import library 
from sklearn import preprocessing

In [ ]:
# create a scaler using Z score normalization / Standardization on a single attribute
zscore_scaler = preprocessing.StandardScaler().fit(train[['Fare']])

In [ ]:
#Apply the Zscore scaler on a single attribute
train['Fare_zscore']=zscore_scaler.transform(train[['Fare']])

In [ ]:
train['Fare_zscore'].describe()

In [ ]:
# # create a scaler using MinMax normalization on a single attribute
#min_max_scaler = preprocessing.MinMaxScaler().fit(train[['Fare']])

In [ ]:
#Apply the MinMax scaler on a single attribute
#train['Fare_MinMax']=min_max_scaler.transform(train[['Fare']])

In [ ]:
#train['Fare_MinMax'].describe()

###### How you can apply the same scaler to test set?

#### 3. One Hot Encoding

In [ ]:
# get dummy variables for categorical varialbes
sexdummy = pd.get_dummies(train['Sex'])

In [ ]:
sexdummy

In [ ]:
# get dummy variables for "Embarked"
embarkeddummy = pd.get_dummies(train['Embarked'],drop_first=True,prefix='Embarked')

# you drop first even though there are 3 values, because both those values being 0,0 inidcates the 3rd column, hence generally we can use n-1 columns to represent n values.

In [ ]:
embarkeddummy

In [ ]:
# adding dummy columns to the existing dataframe
trainwithdummy = pd.concat([train,sexdummy,embarkeddummy],axis=1,sort=True)

In [ ]:
trainwithdummy.info()

In [ ]:
# drop columns that are not needed
traindrop=trainwithdummy.drop(columns=['Name','Sex','Age','Ticket','Fare','male','Embarked'])

In [ ]:
# view the updated dataframe
traindrop.head()

In [ ]:
# save the preprocessed dataset to your machine

In [26]:
test.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    object
 2   Sex       418 non-null    object
 3   Age       332 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Ticket    418 non-null    object
 7   Fare      417 non-null    float64
 8   Cabin     91 non-null     object
 9   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 55.9+ KB

In [32]:
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [33]:
549/(549+342)

0.6161616161616161